
Функция ЗначениеНастройки(КлючНастройки) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Авто_Настройки.Значение КАК Значение
	|ИЗ
	|	Справочник.Авто_Настройки КАК Авто_Настройки
	|ГДЕ
	|	Авто_Настройки.КлючНастройки = &КлючНастройки";
	
	Запрос.УстановитьПараметр("КлючНастройки", КлючНастройки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Значение.Получить();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции