
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ОбновитьВидимостьГрупп();	
		
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	ОбновитьВидимостьГрупп();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьГрупп()
	
	Элементы.ГруппаЗначение.Видимость = Ложь;
	Элементы.ГруппаМассив.Видимость = Ложь;
	
	Если Объект.ТипЗначения = "Значение" Тогда
		
		Элементы.ГруппаЗначение.Видимость = Истина;
		
	ИначеЕсли Объект.ТипЗначения = "Массив" Тогда
		
		Элементы.ГруппаМассив.Видимость = Истина;
		
	ИначеЕсли Объект.ТипЗначения = "Структура" Тогда
		
		Элементы.ГруппаСтруктура.Видимость = Истина;

	ИначеЕсли Объект.ТипЗначения = "Соответствие" Тогда
		
		Элементы.ГруппаСоответствие.Видимость = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗначениеНастройки = Неопределено;
	
	Если Объект.ТипЗначения = "Значение" Тогда
		
		ЗначениеНастройки = Значение;
		
	ИначеЕсли Объект.ТипЗначения = "Массив" Тогда
		
		ЗначениеНастройки = ТаблицаМассив.Выгрузить().ВыгрузитьКолонку("Значение");
		
	ИначеЕсли Объект.ТипЗначения = "Структура" Тогда
		
		ТаблицаЗначений   = ТаблицаСтруктура.Выгрузить();
		ЗначениеНастройки = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗначений);
		
	ИначеЕсли Объект.ТипЗначения = "Соответствие" Тогда
		
		ТаблицаЗначений   = ТаблицаСоответствие.Выгрузить();
		ЗначениеНастройки = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗначений);
		
	КонецЕсли;
	
	ТекущийОбъект.Значение = Новый ХранилищеЗначения(ЗначениеНастройки);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму()
	
	 ЗаполнитьЗначениеНастройки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначениеНастройки()
	
	ЗначениеНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Значение").Получить();
	
	Если ЗначениеНастройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ТипЗначения = "Значение" Тогда
		
		Значение = ЗначениеНастройки;
		
	ИначеЕсли Объект.ТипЗначения = "Массив" Тогда
		
		Для Каждого ЭлементМассива Из ЗначениеНастройки Цикл
			
			НоваяСтрока = ТаблицаМассив.Добавить();
			НоваяСтрока.Значение = ЭлементМассива;
			
		КонецЦикла;
		
	ИначеЕсли Объект.ТипЗначения = "Структура" Тогда
		
		Для Каждого ЭлементМассива Из ЗначениеНастройки Цикл
			
			НоваяСтрока = ТаблицаСтруктура.Добавить();
			НоваяСтрока.Свойство = ЭлементМассива.Ключ;
			НоваяСтрока.Значение = ЭлементМассива.Значение;
			
		КонецЦикла;
		
	ИначеЕсли Объект.ТипЗначения = "Соответствие" Тогда
		
		Для Каждого ЭлементМассива Из ЗначениеНастройки Цикл
			
			НоваяСтрока = ТаблицаСоответствие.Добавить();
			НоваяСтрока.Ключ     = ЭлементМассива.Ключ;
			НоваяСтрока.Значение = ЭлементМассива.Значение;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
